cask_args appdir: "/Applications"

tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/cask-fonts"

brew "readline"
brew "sqlite"
brew "xz"
brew "python"
brew "awscli"
brew "crf++"
brew "mecab"
brew "mecab-ipadic"
brew "cabocha"
brew "curl"
brew "docker"
brew "fzf"
brew "ghq"
brew "git"
brew "lua"
brew "hugo"
brew "mas"
brew "nkf"
brew "node"
brew "nodebrew"
brew "octave"
brew "openssl"
brew "pyenv"
brew "pyenv-virtualenv"
brew "ripgrep"
brew "ruby"
brew "tig"
brew "tmux"
brew "vim"
brew "zsh"
brew "zsh-completions"

cask "1password"
cask "alfred"
cask "android-platform-tools"
cask "docker"
cask "font-hackgen"
cask "google-chrome"
cask "google-japanese-ime"
cask "iterm2"
cask "spectacle"
cask "visual-studio-code"
cask "xquartz"

mas install 497799835 #XCode
mas install 803453959 #Slack

